Tekla Open API Reference for Tekla Structures 2025
SymbolLibrary Class
 The SymbolLibrary class is for handling symbol libraries.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.SymbolLibrary
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public static class SymbolLibrary
<SerializableAttribute>
Public NotInheritable Class SymbolLibrary
Methods
Name | Description
GetSymbolLibraries()
 Gets the names of the available symbol files in the current Tekla Structures environment, in the "symbols" directory, without the suffix.
GetSymbolLibraries(Boolean)
 Gets the names of the available symbol files in the current Tekla Structures environment, in the "symbols" directory, without the suffix.
Top
See Also
Reference
Tekla.Structures.Drawing Namespace